src/Documents/Переводы/Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Переводы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучатель</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Переводы/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма документа Переводы.
// HTML-интерфейс «Новый перевод» по макету Wallet.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		ЗаполнитьСчетаПоУмолчанию();
		Заголовок = "Новый перевод";
		
	Иначе
		
		Заголовок = "Перевод";
		
	КонецЕсли;
	
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбработатьКомандуHTML(КомандаПриложения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьКомандуHTML(КомандаПриложения)
	
	Если КомандаПриложения = "back"
		Или КомандаПриложения = "home"
		Или КомандаПриложения = "operations"
		Или КомандаПриложения = "reports"
		Или КомандаПриложения = "catalogs"
		Или КомандаПриложения = "settings" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "history" Тогда
		
		ОткрытьФорму("Документ.Переводы.Форма.ФормаСписка", , ЭтотОбъект, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли КомандаПриложения = "from" Тогда
		
		НачатьВыборСчета("from");
		
	ИначеЕсли КомандаПриложения = "to" Тогда
		
		НачатьВыборСчета("to");
		
	ИначеЕсли КомандаПриложения = "swap" Тогда
		
		ПоменятьСчетаМестами();
		
	ИначеЕсли КомандаПриложения = "clear-sum" Тогда
		
		Объект.Сумма = 0;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "edit-sum" Или КомандаПриложения = "other-sum" Тогда
		
		НачатьВводСуммы();
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "add:") Тогда
		
		Добавка = Число(Сред(КомандаПриложения, СтрДлина("add:") + 1));
		Объект.Сумма = Объект.Сумма + Добавка;
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "edit-comment" Тогда
		
		НачатьВводКомментария();
		
	ИначеЕсли КомандаПриложения = "submit" Тогда
		
		ВыполнитьПеревод();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборСчета(РежимВыбора)
	
	РежимВыбораСчета = РежимВыбора;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСчетаИзФормы", ЭтотОбъект);
	
	Если РежимВыбора = "from" Тогда
		
		ОбщийМодульКлиент.ПоказатьВыборСчета(ОписаниеОповещения, Объект.СчетИсточник, "Счет списания");
		
	Иначе
		
		ОбщийМодульКлиент.ПоказатьВыборСчета(ОписаниеОповещения, Объект.СчетПолучатель, "Счет зачисления",
			Объект.СчетИсточник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчетаИзФормы(ВыбранныйСчет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйСчет = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимВыбораСчета = "from" Тогда
		
		Объект.СчетИсточник = ВыбранныйСчет;
		
	Иначе
		
		Объект.СчетПолучатель = ВыбранныйСчет;
		
	КонецЕсли;
	
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводСуммы()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСуммы", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводСуммы(ОписаниеОповещения, Объект.Сумма, "Сумма перевода", "transfer");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммы(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Число < 0 Тогда
		
		Число = 0;
		
	КонецЕсли;
	
	Объект.Сумма = Число;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводКомментария()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Комментарий, "Комментарий", 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Комментарий = Лев(Строка, 100);
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьСчетаМестами()
	
	ВременныйСчет = Объект.СчетИсточник;
	Объект.СчетИсточник = Объект.СчетПолучатель;
	Объект.СчетПолучатель = ВременныйСчет;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПеревод()
	
	Если Не ЗначениеЗаполнено(Объект.СчетИсточник) Тогда
		
		ПоказатьПредупреждение(, "Выберите счёт списания.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетПолучатель) Тогда
		
		ПоказатьПредупреждение(, "Выберите счёт зачисления.");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.СчетИсточник = Объект.СчетПолучатель Тогда
		
		ПоказатьПредупреждение(, "Счета списания и зачисления должны отличаться.");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Сумма <= 0 Тогда
		
		ПоказатьПредупреждение(, "Укажите сумму перевода больше нуля.");
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Если Записать(ПараметрыЗаписи) Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ТекстHTML = СобратьHTMLФормыПеревода();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаПоУмолчанию()
	
	ТаблицаСчетов = ТаблицаСчетовСОстатками();
	
	Если ТаблицаСчетов.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетИсточник) Тогда
		
		Объект.СчетИсточник = ТаблицаСчетов[0].Счет;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетПолучатель) Тогда
		
		Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
			
			Если СтрокаСчета.Счет <> Объект.СчетИсточник Тогда
				
				Объект.СчетПолучатель = СтрокаСчета.Счет;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаСчетовСОстатками()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кошелек.Ссылка КАК Счет,
	|	Кошелек.Наименование КАК Наименование,
	|	Кошелек.ВидСчета КАК ВидСчета,
	|	СУММА(ЕСТЬNULL(БалансОстатки.СуммаОстаток, 0)) КАК Остаток
	|ИЗ
	|	Справочник.Счета КАК Кошелек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Баланс.Остатки(&Период, ) КАК БалансОстатки
	|		ПО БалансОстатки.Счета = Кошелек.Ссылка
	|ГДЕ
	|	НЕ Кошелек.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кошелек.Ссылка,
	|	Кошелек.Наименование,
	|	Кошелек.ВидСчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция НайтиСтрокуСчета(ТаблицаСчетов, Счет)
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
		
		Если СтрокаСчета.Счет = Счет Тогда
			
			Возврат СтрокаСчета;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СобратьHTMLФормыПеревода()
	
	ТаблицаСчетов = ТаблицаСчетовСОстатками();
	СтрокаИсточник = НайтиСтрокуСчета(ТаблицаСчетов, Объект.СчетИсточник);
	СтрокаПолучатель = НайтиСтрокуСчета(ТаблицаСчетов, Объект.СчетПолучатель);
	
	ОстатокИсточник = ?(СтрокаИсточник = Неопределено, 0, СтрокаИсточник.Остаток);
	ОстатокПолучатель = ?(СтрокаПолучатель = Неопределено, 0, СтрокаПолучатель.Остаток);
	ОстатокИсточникПосле = ОстатокИсточник - Объект.Сумма;
	ОстатокПолучательПосле = ОстатокПолучатель + Объект.Сумма;
	
	ИмяИсточник = ?(СтрокаИсточник = Неопределено, "Выберите счёт", СтрокаИсточник.Наименование);
	ИмяПолучатель = ?(СтрокаПолучатель = Неопределено, "Выберите счёт", СтрокаПолучатель.Наименование);
	ПодписьИсточник = ?(СтрокаИсточник = Неопределено, "Счёт списания", ПредставлениеВидаСчета(СтрокаИсточник.ВидСчета));
	ПодписьПолучатель = ?(СтрокаПолучатель = Неопределено, "Счёт зачисления", ПредставлениеВидаСчета(СтрокаПолучатель.ВидСчета));
	
	СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(Объект.Сумма, Ложь);
	ОстатокИсточникТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(ОстатокИсточник, Ложь);
	ОстатокПолучательТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(ОстатокПолучатель, Ложь);
	ОстатокИсточникПослеТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(ОстатокИсточникПосле, Ложь);
	ОстатокПолучательПослеТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(ОстатокПолучательПосле, Ложь);
	
	Комментарий = СокрЛП(Объект.Комментарий);
	ДлинаКомментария = СтрДлина(Комментарий);
	ТекстКомментария = ?(ПустаяСтрока(Комментарий), "Добавить комментарий", Комментарий);
	КлассКомментария = ?(ПустаяСтрока(Комментарий), "placeholder", "");
	
	КнопкаСуммы = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(Объект.Сумма, Ложь);
	
	Строки = Новый Массив;
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>");
	Строки.Добавить(СтилиФормыПеревода());
	Строки.Добавить("</style></head><body>");
	
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(Заголовок) + "</div>");
	Строки.Добавить("<a class=""icon-btn"" href=""app:history"">" + SVGИстория() + "</a>");
	Строки.Добавить("</div>");
	
	Строки.Добавить("<div class=""lbl"">Счет списания</div>");
	Строки.Добавить(HTMLКарточкаСчета("from", "#EFF6FF", "#2563EB", SVGКарта(), ИмяИсточник, ПодписьИсточник, ОстатокИсточникТекст));
	
	Строки.Добавить("<div class=""swap-wrap""><a class=""swap"" href=""app:swap"">" + SVGСтрелкаВниз() + "</a></div>");
	
	Строки.Добавить("<div class=""lbl"">Счет зачисления</div>");
	Строки.Добавить(HTMLКарточкаСчета("to", "#F0FDFA", "#14B8A6", SVGКошелек(), ИмяПолучатель, ПодписьПолучатель, ОстатокПолучательТекст));
	
	Строки.Добавить("<div class=""card amount-card"">");
	Строки.Добавить("<div class=""lbl"">Сумма перевода</div>");
	Строки.Добавить("<div class=""amount-row"">");
	Строки.Добавить("<a class=""amount"" href=""app:edit-sum"">" + СуммаТекст + "</a>");
	Строки.Добавить("<a class=""clear"" href=""app:clear-sum"">" + SVGОчистить() + "</a>");
	Строки.Добавить("</div>");
	Строки.Добавить("<div class=""chips"">");
	Строки.Добавить("<a class=""chip"" href=""app:add:1000"">+1&nbsp;000</a>");
	Строки.Добавить("<a class=""chip"" href=""app:add:5000"">+5&nbsp;000</a>");
	Строки.Добавить("<a class=""chip"" href=""app:add:10000"">+10&nbsp;000</a>");
	Строки.Добавить("<a class=""chip"" href=""app:other-sum"">Другая</a>");
	Строки.Добавить("</div></div>");
	
	Строки.Добавить("<a class=""card comment-card"" href=""app:edit-comment"">");
	Строки.Добавить("<div class=""lbl"">Комментарий</div>");
	Строки.Добавить("<div class=""comment " + КлассКомментария + """>" + ЭкранироватьHTML(ТекстКомментария) + "</div>");
	Строки.Добавить("<div class=""counter"">" + Формат(ДлинаКомментария, "ЧН=0; ЧГ=") + "/100</div>");
	Строки.Добавить("</a>");
	
	Если ЗначениеЗаполнено(Объект.СчетИсточник) И ЗначениеЗаполнено(Объект.СчетПолучатель) И Объект.Сумма > 0 Тогда
		
		Строки.Добавить("<div class=""info"">");
		Строки.Добавить("<div class=""info-ico"">" + SVGИнфо() + "</div>");
		Строки.Добавить("<div class=""info-body"">");
		Строки.Добавить("<div class=""info-title"">После перевода:</div>");
		Строки.Добавить("<div class=""info-row""><span>" + ЭкранироватьHTML(ИмяИсточник) + "</span><span>"
			+ ОстатокИсточникПослеТекст + "</span></div>");
		Строки.Добавить("<div class=""info-row""><span>" + ЭкранироватьHTML(ИмяПолучатель) + "</span><span>"
			+ ОстатокПолучательПослеТекст + "</span></div>");
		Строки.Добавить("</div></div>");
		
	КонецЕсли;
	
	Строки.Добавить("<div class=""actions"">");
	Строки.Добавить("<a class=""submit"" href=""app:submit"">" + SVGОтправить() + "<span>Перевести "
		+ КнопкаСуммы + "</span></a>");
	Строки.Добавить("</div>");
	
	Строки.Добавить(HTMLНижняяНавигация());
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

&НаСервере
Функция HTMLКарточкаСчета(Команда, ФонИконки, ЦветИконки, SVG, Имя, Подпись, ОстатокТекст)
	
	Возврат "<a class=""card account"" href=""app:" + Команда + """>"
		+ "<span class=""acc-ico"" style=""background:" + ФонИконки + ";color:" + ЦветИконки + """>" + SVG + "</span>"
		+ "<span class=""acc-mid""><span class=""acc-name"">" + ЭкранироватьHTML(Имя) + "</span>"
		+ "<span class=""acc-sub"">" + ЭкранироватьHTML(Подпись) + "</span></span>"
		+ "<span class=""acc-right""><span class=""acc-sum"">" + ОстатокТекст + "</span>"
		+ "<span class=""chev"">▾</span></span></a>";
	
КонецФункции

&НаСервере
Функция ПредставлениеВидаСчета(ВидСчета)
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		Возврат "Наличные";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		
		Возврат "Банковская карта";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		Возврат "Банковский счёт";
		
	КонецЕсли;
	
	Возврат "Счёт";
	
КонецФункции

&НаСервере
Функция СтилиФормыПеревода()
	
	Возврат "*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}"
		+ "body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;background:#FAFAFA;color:#111827;padding:12px 16px 160px;line-height:1.3}"
		+ "a{text-decoration:none;color:inherit}"
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}"
		+ ".title{font-size:18px;font-weight:700;color:#111827}"
		+ ".icon-btn{width:36px;height:36px;border-radius:50%;background:#F3F4F6;display:flex;align-items:center;justify-content:center;color:#6B7280}"
		+ ".lbl{font-size:12px;font-weight:600;color:#6B7280;margin:0 0 6px 2px}"
		+ ".card{display:block;background:#fff;border:1px solid #E5E7EB;border-radius:16px;padding:14px;margin-bottom:10px}"
		+ ".account{display:flex;align-items:center}"
		+ ".acc-ico{width:40px;height:40px;border-radius:12px;flex-shrink:0;display:flex;align-items:center;justify-content:center;margin-right:14px}"
		+ ".acc-mid{flex:1;min-width:0}"
		+ ".acc-name{display:block;font-size:15px;font-weight:700;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
		+ ".acc-sub{display:block;margin-top:2px;font-size:12px;color:#6B7280}"
		+ ".acc-right{text-align:right;flex-shrink:0;margin-left:10px}"
		+ ".acc-sum{display:block;font-size:14px;font-weight:700}"
		+ ".chev{display:block;margin-top:2px;font-size:12px;color:#9CA3AF}"
		+ ".swap-wrap{display:flex;justify-content:center;margin:-2px 0 8px}"
		+ ".swap{width:36px;height:36px;border-radius:50%;background:#2563EB;color:#fff;display:flex;align-items:center;justify-content:center;box-shadow:0 4px 10px rgba(37,99,235,0.25)}"
		+ ".amount-card .amount-row{display:flex;align-items:center;justify-content:space-between;margin-top:4px}"
		+ ".amount{font-size:32px;font-weight:700;letter-spacing:-0.02em;color:#111827;margin-right:10px}"
		+ ".clear{width:28px;height:28px;border-radius:50%;background:#F3F4F6;display:flex;align-items:center;justify-content:center;color:#9CA3AF;flex-shrink:0}"
		+ ".chips{display:flex;flex-wrap:wrap;margin-top:12px}"
		+ ".chip{display:inline-flex;align-items:center;justify-content:center;padding:8px 12px;border-radius:12px;background:#F3F4F6;font-size:13px;font-weight:600;color:#374151;margin:0 8px 8px 0}"
		+ ".comment-card{position:relative}"
		+ ".comment{margin-top:4px;font-size:15px;font-weight:600;color:#111827;min-height:22px;padding-right:48px}"
		+ ".comment.placeholder{color:#9CA3AF;font-weight:500}"
		+ ".counter{position:absolute;right:14px;bottom:12px;font-size:12px;color:#9CA3AF}"
		+ ".info{display:flex;align-items:flex-start;background:#EFF6FF;border-radius:16px;padding:12px 14px;margin:4px 0 12px}"
		+ ".info-ico{width:22px;height:22px;border-radius:50%;background:#2563EB;color:#fff;display:flex;align-items:center;justify-content:center;flex-shrink:0;margin-right:12px}"
		+ ".info-body{flex:1;min-width:0}"
		+ ".info-title{font-size:13px;font-weight:700;color:#1E3A8A;margin-bottom:6px}"
		+ ".info-row{display:flex;justify-content:space-between;font-size:13px;font-weight:600;color:#1E40AF;padding:2px 0}"
		+ ".info-row span:last-child{margin-left:10px;white-space:nowrap}"
		+ ".actions{position:fixed;left:0;right:0;bottom:58px;padding:10px 16px;background:linear-gradient(180deg,rgba(250,250,250,0),#FAFAFA 28%);z-index:11}"
		+ ".submit{display:flex;align-items:center;justify-content:center;background:#2563EB;color:#fff;border-radius:14px;padding:14px 16px;font-size:16px;font-weight:700;box-shadow:0 6px 16px rgba(37,99,235,0.28)}"
		+ ".submit svg{margin-right:8px;flex-shrink:0}"
		+ ".submit span{white-space:nowrap}"
		+ ".nav{position:fixed;left:0;right:0;bottom:0;background:#fff;border-top:1px solid #E5E7EB;display:flex;padding:6px 2px calc(6px + env(safe-area-inset-bottom,0px));z-index:12}"
		+ ".nav a{flex:1;text-align:center;padding:4px 1px;color:#6B7280;font-size:9px;font-weight:600;line-height:1.15}"
		+ ".nav .ico{height:18px;display:flex;align-items:center;justify-content:center;margin-bottom:2px}"
		+ ".nav .ico svg{display:block;width:18px;height:18px}"
		+ ".nav a.active{color:#2563EB}";
	
КонецФункции

&НаСервере
Функция HTMLНижняяНавигация()
	
	Возврат "<nav class=""nav"">"
		+ "<a class=""active"" href=""app:home""><span class=""ico"">" + SVGДом() + "</span>Главная</a>"
		+ "<a href=""app:operations""><span class=""ico"">" + SVGОперации() + "</span>Операции</a>"
		+ "<a href=""app:reports""><span class=""ico"">" + SVGДиаграмма() + "</span>Отчёты</a>"
		+ "<a href=""app:catalogs""><span class=""ico"">" + SVGПапка() + "</span>Справочники</a>"
		+ "<a href=""app:settings""><span class=""ico"">" + SVGНастройки() + "</span>Настройки</a>"
		+ "</nav>";
	
КонецФункции

&НаСервере
Функция ЭкранироватьHTML(Знач Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(Знач АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	АдресСсылки = СокрЛП(АдресСсылки);
	Префикс = "app:";
	Позиция = СтрНайти(НРег(АдресСсылки), Префикс);
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + СтрДлина(Префикс));
	
КонецФункции

&НаСервере
Функция SVGСтрелкаНазад()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M15 18l-6-6 6-6""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGИстория()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M3 12a9 9 0 1 0 3-6.7""/><path d=""M3 4v5h5""/><path d=""M12 7v5l3 2""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGСтрелкаВниз()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""#fff"" stroke-width=""2.5"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M12 5v14""/><path d=""M19 12l-7 7-7-7""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGКарта()
	
	Возврат "<svg width=""20"" height=""20"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><rect x=""2"" y=""5"" width=""20"" height=""14"" rx=""2""/><path d=""M2 10h20""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGКошелек()
	
	Возврат "<svg width=""20"" height=""20"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M20 7H4a2 2 0 0 0-2 2v8a2 2 0 0 0 2 2h16a2 2 0 0 0 2-2V9a2 2 0 0 0-2-2z""/><path d=""M16 12h.01""/><path d=""M2 10h20""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGОчистить()
	
	Возврат "<svg width=""14"" height=""14"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2.5"" stroke-linecap=""round""><path d=""M18 6L6 18""/><path d=""M6 6l12 12""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGИнфо()
	
	Возврат "<svg width=""12"" height=""12"" viewBox=""0 0 24 24"" fill=""none"" stroke=""#fff"" stroke-width=""2.5"" stroke-linecap=""round""><circle cx=""12"" cy=""12"" r=""9""/><path d=""M12 10v6""/><path d=""M12 7h.01""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGОтправить()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""#fff"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M22 2L11 13""/><path d=""M22 2l-7 20-4-9-9-4 20-7z""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGДом()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M3 10.5L12 3l9 7.5""/><path d=""M5 9.5V20h14V9.5""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGОперации()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M7 7h11l-3-3""/><path d=""M17 17H6l3 3""/><path d=""M6 12h12""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGДиаграмма()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M4 19h16""/><path d=""M7 16V9""/><path d=""M12 16V5""/><path d=""M17 16v-3""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGПапка()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M3 7h6l2 2h10v10a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2V7z""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGНастройки()
	
	Возврат "<svg viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><circle cx=""12"" cy=""12"" r=""3""/><path d=""M12 2v2M12 20v2M4.9 4.9l1.4 1.4M17.7 17.7l1.4 1.4M2 12h2M20 12h2M4.9 19.1l1.4-1.4M17.7 6.3l1.4-1.4""/></svg>";
	
КонецФункции

#КонецОбласти
